In [10]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [11]:
%%sql
SELECT *
  FROM sqlite_master
 WHERE type='table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

### Inspect facts table

In [12]:
%%sql
SELECT * FROM facts LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

### Inspect main stats from facts

In [13]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
FROM facts;

Done.

[(0, 7256490011, 0.0, 4.02)]

In [14]:
%%sql
SELECT name, MIN(population)
FROM facts;

Done.

[('Antarctica', 0)]

In [23]:
%%sql
SELECT name, MAX(population)
FROM facts;

Done.

[('World', 7256490011)]

In [27]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
FROM facts
WHERE name != 'World'
;

Done.

[(0, 1367485388, 0.0, 4.02)]

In [29]:
%%sql
SELECT AVG(population)
FROM facts;

Done.

[(62094928.32231405,)]

In [30]:
%%sql
SELECT AVG(area)
FROM facts;

Done.

[(555093.546184739,)]

### Find all countries where the population is above average and the area is below average.

In [37]:
%%sql
SELECT name, population, area
FROM facts
WHERE population > (SELECT AVG(population) from facts) AND area < (SELECT AVG(area) FROM facts)

Done.

[('Bangladesh', 168957745, 148460),
 ('Germany', 80854408, 357022),
 ('Japan', 126919659, 377915),
 ('Philippines', 100998376, 300000),
 ('Thailand', 67976405, 513120),
 ('United Kingdom', 64088222, 243610),
 ('Vietnam', 94348835, 331210)]

### What country has the most people?

In [39]:
%%sql
SELECT name, MAX(population)
FROM facts
WHERE name != "World";

Done.

[('China', 1367485388)]

### What country has the highest growth rate?

In [40]:
%%sql
SELECT name, MAX(population_growth)
FROM facts;

Done.

[('South Sudan', 4.02)]

### Which countries have the highest ratios of water to land? Which countries have more water than land?

In [52]:
%%sql
SELECT name, CAST(area_water as FLOAT)/area_land as water_ratio
FROM facts
ORDER BY water_ratio DESC
LIMIT 10;

Done.

[('British Indian Ocean Territory', 905.6666666666666),
 ('Virgin Islands', 4.520231213872832),
 ('Puerto Rico', 0.5547914317925592),
 ('Bahamas, The', 0.3866133866133866),
 ('Guinea-Bissau', 0.2846728307254623),
 ('Malawi', 0.25939625850340137),
 ('Netherlands', 0.22571032366565366),
 ('Uganda', 0.22292237442922375),
 ('Eritrea', 0.16435643564356436),
 ('Liberia', 0.15623961794019933)]

In [46]:
%%sql
SELECT name, MAX(CAST(area_water as FLOAT)/area_land) as max_water_ratio
FROM facts;

Done.

[('British Indian Ocean Territory', 905.6666666666666)]

In [51]:
%%sql
SELECT name, CAST(area_water as FLOAT)/area_land as water_ratio
FROM facts
ORDER BY water_ratio DESC
LIMIT 10;

Done.

[('British Indian Ocean Territory', 905.6666666666666),
 ('Virgin Islands', 4.520231213872832),
 ('Puerto Rico', 0.5547914317925592),
 ('Bahamas, The', 0.3866133866133866),
 ('Guinea-Bissau', 0.2846728307254623),
 ('Malawi', 0.25939625850340137),
 ('Netherlands', 0.22571032366565366),
 ('Uganda', 0.22292237442922375),
 ('Eritrea', 0.16435643564356436),
 ('Liberia', 0.15623961794019933)]

### British Indian Ocean Territory & Virgin Islands have more water than land

### Which countries have a higher death rate than birth rate?

In [48]:
%%sql
SELECT name
FROM facts
WHERE death_rate >birth_rate;

Done.

[('Austria',),
 ('Belarus',),
 ('Bosnia and Herzegovina',),
 ('Bulgaria',),
 ('Croatia',),
 ('Czech Republic',),
 ('Estonia',),
 ('Germany',),
 ('Greece',),
 ('Hungary',),
 ('Italy',),
 ('Japan',),
 ('Latvia',),
 ('Lithuania',),
 ('Moldova',),
 ('Monaco',),
 ('Poland',),
 ('Portugal',),
 ('Romania',),
 ('Russia',),
 ('Serbia',),
 ('Slovenia',),
 ('Ukraine',),
 ('Saint Pierre and Miquelon',)]

### What countries have the highest population/area ratio and how does it compare to list we found in the previous screen?

In [49]:
%%sql
SELECT name, CAST(population as FLOAT)/area as popn_area_ratio
FROM facts
ORDER BY popn_area_ratio DESC
LIMIT 10;

Done.

[('Macau', 21168.964285714286),
 ('Monaco', 15267.5),
 ('Singapore', 8141.279770444763),
 ('Hong Kong', 6445.041516245487),
 ('Gaza Strip', 5191.819444444444),
 ('Gibraltar', 4876.333333333333),
 ('Bahrain', 1771.8592105263158),
 ('Maldives', 1319.6409395973155),
 ('Malta', 1310.01582278481),
 ('Bermuda', 1299.9259259259259)]